# TP1 : Remise dans le bain

**Ce TP va servir d'introduction**, pour mieux apprendre Ã  se connaÃ®tre, et que vous mettiez la main sur des outils qu'on utilisera probablement tout le long du cours.

Le cours, justement, est intitulÃ© "Virtualisation RÃ©seau", **on va donc profiter de ce premier TP pour mettre en place nos outils de virtualisation**, et commencer Ã  jouer avec.

## Sommaire

- [TP1 : Remise dans le bain](#tp1--remise-dans-le-bain)
  - [Sommaire](#sommaire)
  - [0. Setup](#0-setup)
- [I. Most simplest LAN](#i-most-simplest-lan)
- [II. Ajoutons un switch](#ii-ajoutons-un-switch)
- [III. Serveur DHCP](#iii-serveur-dhcp)
  - [2. DHCP spoofing](#2-dhcp-spoofing)
  - [3. BONUS : DHCP starvation](#3-bonus--dhcp-starvation)

## 0. Setup

âžœ **TÃ©lÃ©chargez de suite** :

- un outil pour **virtualiser des Ã©quipements rÃ©seau** et simuler des connexions rÃ©seau
  - on utilisera [**GNS3**](https://www.gns3.com/)
- un outil pour **gÃ©rer des VMs**
  - je vous recommande [**VirtualBox**](https://www.virtualbox.org/)
  - il faut qu'il soit compatible avec GNS3
- un outil de **sniffing rÃ©seau**
  - je vous recommande l'excellent [**Wireshark**](https://www.wireshark.org/) Ã©videmment

Pour ce premier TP, on va commencer smooth, et on utilisera avec ces deux outils de virtu -GNS3 et VirtualBox- uniquement des systÃ¨mes Linux.

> *On utilisera souvent des OS Linux dans le cours, c'est pour nous un outil de choix : un outil robuste et Ã©prouvÃ© dans le milieources : l'Ã©nergie Ã§a pousse pas dans les arbres ðŸ™ƒ

âžœ Une fois les outils tÃ©lÃ©chargÃ©s et prÃªts Ã  Ãªtre lancer, vous pouvez passer Ã  la suite du TP :

- chaque partie correspond Ã  une topologie Ã  rÃ©aliser dans GNS3
- vous vous servirez de VPCS pour les clients ou de machines Linux
- installez l'OS de votre choix sur une nouvelle VM, et Ã©teignez lÃ . Vous pourrez la cloner Ã  l'infini dÃ¨s que vous avez besoin d'une machine pour un TP
- rappel : je veux un compte-rendu qui contient TOUTES les commandes rÃ©alisÃ©es

> ***N'hÃ©sitez pas Ã  m'appeler, autant de fois que nÃ©cessaire, si une Ã©tape n'est pas claire, si vous comprenez mal quelque chose, ou pour toute question.***

# I. Most simplest LAN

![Topologie nÂ°1](./img/topo1.png)

> *VM Linux ou VPCS, libre Ã  vous !*

Un LAN (ou "RÃ©seau Local" en franÃ§ais) c'est juste un rÃ©seau formÃ© de plusieurs machines connectÃ©es physiquement entre elles.

Pour Ã§a, chaque machine a besoin d'au moins une carte rÃ©seau, et on relie par des cÃ¢bles les machines entre elles. (Merci captain obvious ?)

On va donc commencer au plus simple : deux machines connectÃ©es par un cÃ¢ble.

Les objectifs de cette partie :

- monter la topologie dans GNS3 *(drag'n'drop des machins et tirer des cÃ¢bles dans GNS3)*
- dÃ©finir des IPs sur les deux machines
- visualiser l'IP choisie, ainsi que l'adresse MAC prÃ©determinÃ©e
- vÃ©rifier que les deux machines peuvent communiquer en faisant un `ping`
- visualiser le `ping` avec Wireshark

Vous utiliserez les IPs suivantes :
g

| Machine           | Adresse IP    |
| ----------------- | ------------- |
| `node1.tp1.efrei` | `10.1.1.1/24` |
| `node2.tp1.efrei` | `10.1.1.2/24` |

ðŸŒž **DÃ©terminer l'adresse MAC de vos deux machines**

```
PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.1/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10006
RHOST:PORT  : 127.0.0.1:10007
MTU:        : 1500
```

```

PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.2/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10008
RHOST:PORT  : 127.0.0.1:10009
MTU:        : 1500
```

ðŸŒž **DÃ©finir une IP statique sur les deux machines**

```|
ip 10.1.1.1/24
Checking for duplicate address...
PC1 : 10.1.1.1 255.255.255.0

PC1> save
Saving startup configuration to startup.vpc
.  done

PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.1/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10006
RHOST:PORT  : 127.0.0.1:10007
MTU:        : 1500

PC1>

```

```
ip 10.1.1.2/24
Checking for duplicate address...
sPC1 : 10.1.1.2 255.255.255.0

PC2> save
Saving startup configuration to startup.vpc
.  done

PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.2/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10008
RHOST:PORT  : 127.0.0.1:10009
MTU:        : 1500

PC2>


```

ðŸŒž **Effectuer un `ping` d'une machine Ã  l'autre**

```
ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=0.801 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=1.383 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=64 time=1.165 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=64 time=0.873 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=64 time=0.915 ms

PC1>

```
```
PC2> ping 10.1.1.1
84 bytes from 10.1.1.1 icmp_seq=1 ttl=64 time=1.144 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=64 time=0.739 ms
84 bytes from 10.1.1.1 icmp_seq=3 ttl=64 time=0.764 ms
84 bytes from 10.1.1.1 icmp_seq=4 ttl=64 time=1.137 ms
84 bytes from 10.1.1.1 icmp_seq=5 ttl=64 time=1.271 ms

PC2>

```
ðŸŒž **Wireshark !**

````
le protocole utilisÃ© est ICMP

````

ðŸŒž **ARP**

PC1> ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=0.797 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=1.207 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=64 time=0.789 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=64 time=1.042 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=64 time=1.049 ms

PC1> show arp

````
00:50:79:66:68:01  10.1.1.2 expires in 111 seconds
````


# II. Ajoutons un switch

![Topologie nÂ°2](./img/topo2.png)

> *VM Linux ou VPCS, libre Ã  vous !*

Un switch vient rÃ©soudre une problÃ©matique simple : comment relier + de deux machines entre elles ? Le switch agit comme une simple multiprise rÃ©seau (dans son fonctionnement basique du moins ; un switch moderne possÃ¨de des fonctionnalitÃ©s plus avancÃ©es).

Le switch n'est pas vraiment un membre du rÃ©seau : il n'a pas d'adresse IP, on ne peut pas directement lui envoyer de message. Il se charge simplement de faire passer les messages d'une machine Ã  une autre lorsqu'elles souhaitent discuter.

On va commencer simple : GNS3 fournit des switches tout nuls, prÃªts Ã  l'emploi.

> *Vous pouvez rÃ©utiliser les machines de la partie prÃ©cÃ©dente.*

| Machine           | Adresse IP    |
| ----------------- | ------------- |
| `node1.tp1.efrei` | `10.1.1.1/24` |
| `node2.tp1.efrei` | `10.1.1.2/24` |
| `node3.tp1.efrei` | `10.1.1.3/24` |

ðŸŒž **DÃ©terminer l'adresse MAC de vos trois machines**
```
PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.1/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10006
RHOST:PORT  : 127.0.0.1:10007
MTU:        : 1500
```

```

PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.2/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10008
RHOST:PORT  : 127.0.0.1:10009
MTU:        : 1500
```
```
PC3> show ip

NAME        : PC3[1]
IP/MASK     : 0.0.0.0/0
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20005
RHOST:PORT  : 127.0.0.1:20006
MTU         : 1500

```

ðŸŒž **DÃ©finir une IP statique sur les trois machines**

```
PC3> ip 10.1.1.3/24
Checking for duplicate address...
save
PC3 : 10.1.1.3 255.255.255.0

PC3> save
Saving startup configuration to startup.vpc
.  done

PC3> sh ip````

NAME        : PC3[1]
IP/MASK     : 10.1.1.3/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 20005
RHOST:PORT  : 127.0.0.1:20006
MTU         : 1500

PC3>

````

```|
ip 10.1.1.1/24
Checking for duplicate address...
PC1 : 10.1.1.1 255.255.255.0

PC1> save
Saving startup configuration to startup.vpc
.  done

PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.1/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:00
LPORT       : 10006
RHOST:PORT  : 127.0.0.1:10007
MTU:        : 1500

PC1>

```

```
ip 10.1.1.2/24
Checking for duplicate address...
sPC1 : 10.1.1.2 255.255.255.0

PC2> save
Saving startup configuration to startup.vpc
.  done

PC2> sh ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.2/24
GATEWAY     : 0.0.0.0
DNS         :
MAC         : 00:50:79:66:68:01
LPORT       : 10008
RHOST:PORT  : 127.0.0.1:10009
MTU:        : 1500

PC2>


```


ðŸŒž **Effectuer des `ping` d'une machine Ã  l'autre**

```
PC1> ping 10.1.1.2

84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=1.132 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=1.447 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=64 time=0.470 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=64 time=2.007 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=64 time=1.056 ms

PC1>

PC2> ping 10.1.1.3

84 bytes from 10.1.1.3 icmp_seq=1 ttl=64 time=0.413 ms
84 bytes from 10.1.1.3 icmp_seq=2 ttl=64 time=0.623 ms
84 bytes from 10.1.1.3 icmp_seq=3 ttl=64 time=0.426 ms
84 bytes from 10.1.1.3 icmp_seq=4 ttl=64 time=0.712 ms
84 bytes from 10.1.1.3 icmp_seq=5 ttl=64 time=0.539 ms

PC2>

PC3> ping 10.1.1.1

84 bytes from 10.1.1.1 icmp_seq=1 ttl=64 time=0.349 ms
84 bytes from 10.1.1.1 icmp_seq=2 ttl=64 time=0.625 ms
84 bytes from 10.1.1.1 icmp_seq=3 ttl=64 time=0.770 ms
84 bytes from 10.1.1.1 icmp_seq=4 ttl=64 time=0.534 ms
84 bytes from 10.1.1.1 icmp_seq=5 ttl=64 time=2.409 ms

PC3>
```


# III. Serveur DHCP



ðŸŒž **Donner un accÃ¨s Internet Ã  la machine `dhcp.tp1.efrei`**

```
[root@localhost ~]$ ping google.com
PING google.com (216.58.214.174) 56(84) bytes of data.
64 bytes from mad01s26-in-f174.1e100.net (216.58.214.174): icmp_seq q = 1 ttl I = 63 time 37.4 ms
64 bytes from par10s42-in-f14.1e100.net (216.58.214.174): icmp_seq=2 ttl I = 63 time=28.7 ms
```

ðŸŒž **Installer et configurer un serveur DHCP**

```
dnf-y install dhcp-server
```
```
vi /etc/dhcp/dhcpd.conf
```
```
authoritative;
subnet 10.1.1.0 netmask 255.255.255.0 {
	range 10.1.1.10 10.1.1.50;
	option broadcast-address 10.1.1.1;
	option routers 10.1.1.1;
}
```
```
systemctl enable --now dhcpd
```


ðŸŒž **RÃ©cupÃ©rer une IP automatiquement depuis les 3 nodes**

```
PC1> dhcp
DORA IP 10.1.1.10/24 GW 10.1.1.1

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.10/24
GATEWAY     : 10.1.1.1
DNS         : 
DHCP SERVER : 10.1.1.253
DHCP LEASE  : 563, 570/285/498
MAC         : 00:50:79:66:68:01
LPORT       : 20007
RHOST:PORT  : 127.0.0.1:20008
MTU         : 1500
```

```
PC2> dhcp
DORA IP 10.1.1.11/24 GW 10.1.1.1

PC2> show ip

NAME        : PC2[1]
IP/MASK     : 10.1.1.11/24
GATEWAY     : 10.1.1.1
DNS         : 
DHCP SERVER : 10.1.1.253
DHCP LEASE  : 594, 599/299/524
MAC         : 00:50:79:66:68:00
LPORT       : 20009
RHOST:PORT  : 127.0.0.1:20010
MTU         : 1500
```

```
PC3> dhcp
DORA IP 10.1.1.12/24 GW 10.1.1.1

PC3> show ip

NAME        : PC3[1]
IP/MASK     : 10.1.1.12/24
GATEWAY     : 10.1.1.1
DNS         : 
DHCP SERVER : 10.1.1.253
DHCP LEASE  : 584, 599/299/524
MAC         : 00:50:79:66:68:02
LPORT       : 20011
RHOST:PORT  : 127.0.0.1:20012
MTU         : 1500
```


ðŸŒž **Wireshark !**

```
voir capture_dhcp_wireshark
```

## 2. DHCP spoofing
âžœ **Introduire une nouvelle VM dans la topologie, OS de votre choix**

ðŸŒž **Configurez dnsmasq**

```
dnf install -y dnsmasq
```
```
dhcp-range=10.1.1.210 10.1.1.250 255.255.255.0 8h
dhcp-authoritative
interface=enp0s3
```

ðŸŒž **Test !**

```
PC1> dhcp
DORA IP 10.1.1.210/24 GW 10.1.1.1

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 10.1.1.210/24
```


ðŸŒž **Now race !**

```
ne sachant pas quoi mettre, je met les rÃ©sultats des statistiques sur 3 vps que j'ai Ã©teins puis rallumÃ© 5 fois :

pc1: 5fois le bon dhcp
pc2 : 3 fois el bon dhcp, 2 fois le mauvais
pc3: pareil 

```

ðŸŒž **Wireshark !**

- capturez cette course :d
- je veux une capture wireshark `race.pcap` qui montre les deux serveurs DHCP qui rÃ©pondent

> *Si on met vraiment l'attaque en place et qu'on veut gagner la course, on n'hÃ©site pas Ã  mettre un coup de batte dans les jambes du concurrent : essayer de ralentir le serveur DHCP lÃ©gitime. On abordera Ã§a plus tard maybe, je vous invite fort Ã  faire des recherches sur le sujet : comment ralentir une machine qu'on peut joindre sur le rÃ©seau, et spÃ©cifiquement un serveur DHCP ici. Aussi on remettra en place l'attaque dans des scÃ©narios oÃ¹ on usurpe aussi l'identitÃ© du routeur.*

## 3. BONUS : DHCP starvation

Une attaque trÃ¨s dÃ©bile et simple Ã  mettre en place pour **DOS l'accÃ¨s Ã  un LAN** s'il n'y a pas de protections particuliÃ¨res. **C'est naze, mais c'est lÃ ** :d

Le principe est simple : **faire de multiples Ã©changes DORA avec le serveur DHCP pour rÃ©cupÃ©rer toutes les IP disponibles dans le rÃ©seau.**

On usurpe une adresse MAC (qu'elle existe ou non), on demande une adresse IP, on la rÃ©cupÃ¨re (merci). On rÃ©pÃ¨te l'opÃ©ration avec une nouvelle fake adresse MAC, une nouvelle IP (merci). Etc. Jusqu'Ã  Ã©puiser toutes les adresses de la range.

Il existe des tools pour faire Ã§a, vous pouvez aussi essayer (recommandÃ©) de le **coder vous-mÃªmes avec Scapy** (une dinguerie cette lib) : on peut forger Ã  peu prÃ¨s tout et n'importe quoi comme trame, et trÃ¨s facilement, avec Scapy.